app/controllers/articulos_controller.rb

  def create
  #  render plain: params[:articulo].inspect
    @articulo = Articulo.new(articulo_params)

    if @articulo.save
---
INSERT INTO "articulos" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "drftgyuhij"], ["text", "ghjbnk"], ["created_at", "2018-07-14 18:37:29.287001"], ["updated_at", "2018-07-14 18:37:29.287001"]]

  def update
    set_articulo
    if @articulo.update(articulo_params)
---
UPDATE "articulos" SET "text" = ?, "updated_at" = ? WHERE "articulos"."id" = ?  [["text", "fghjkl"], ["updated_at", "2018-07-14 18:55:26.583703"], ["id", 2]]

  def index
    @articulos = Articulo.all
---
SELECT "articulos".* FROM "articulos"

  def destroy
    set_articulo
    @articulo.destroy
---
DELETE FROM "articulos" WHERE "articulos"."id" = ?  [["id", 1]]

    def set_articulo
      @articulo = Articulo.find(params[:id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]