app/controllers/comentarios_controller.rb

  def create
    find_articulo
    @comentario = @articulo.comentarios.create(comentario_params)
---
INSERT INTO "comentarios" ("nombre", "cuerpo", "articulo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "bhn"], ["cuerpo", ""], ["articulo_id", 2], ["created_at", "2018-07-14 20:36:47.679045"], ["updated_at", "2018-07-14 20:36:47.679045"]]

  def destroy
    find_articulo
    @comentario = @articulo.comentarios.find(params[:id])
    @comentario.destroy
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = ? AND "comentarios"."id" = ? LIMIT ?  [["articulo_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = ?  [["id", 2]]

    def find_articulo
      @articulo = Articulo.find (params[:articulo_id])
---
SELECT  "articulos".* FROM "articulos" WHERE "articulos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]